add: fix documentation to pt-br into most classes + added debug.py to actuate with the logger.py in utils + changes into readme and todo list
